
icc2_shell> set design pulpissimo
pulpissimo
icc2_shell> sh rm /home/ICer/Desktop/pulp/ndm/pulpissimo.dlib/pulpissimo_setup/design.ndm.lock
Error: rm: cannot remove '/home/ICer/Desktop/pulp/ndm/pulpissimo.dlib/pulpissimo_setup/design.ndm.lock': No such file or directory
        Use error_info for more info. (CMD-013)
icc2_shell> 
icc2_shell> 
icc2_shell> set design_lib_path /home/ICer/Desktop/pulp/ndm
/home/ICer/Desktop/pulp/ndm
icc2_shell> open_block /home/ICer/Desktop/pulp/ndm/pulpissimo.dlib:pul2pissimo_setup.design
Information: User units loaded from library 'IO_ndm' (LNK-040)
Opening block 'pulpissimo.dlib:pul2pissimo_setup.design' in edit mode
{pulpissimo.dlib:pul2pissimo_setup.design}
icc2_shell> copy_block -from_block pulpissimo.dlib:pul2pissimo_setup.design -to_block ${design}_fp
{pulpissimo.dlib:pulpissimo_fp.design}
icc2_shell> current_block ${design}_fp.design
{pulpissimo.dlib:pulpissimo_fp.design}
icc2_shell> start_gui
Begin building search trees for block pulpissimo.dlib:pulpissimo_fp.design
Done building search trees for block pulpissimo.dlib:pulpissimo_fp.design (time 0s)
icc2_shell> link_block
Using libraries: pulpissimo.dlib IO_ndm PLL_ndm saed32rvt_ss0p95vn40c SRAM_ndm
Warning: In library pulpissimo.dlib, no block views exist for block pulpissimo. (LNK-064)
Visiting block pulpissimo.dlib:pulpissimo_fp.design
Design 'pulpissimo' was successfully linked.
1
icc2_shell> set_attribute [get_layers M1] routing_direction vertical
Information: The design specific attribute override for layer 'M1' is set in the current block 'pulpissimo_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M1}
icc2_shell> set_attribute [get_layers M2] routing_direction horizontal
Information: The design specific attribute override for layer 'M2' is set in the current block 'pulpissimo_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M2}
icc2_shell> set_attribute [get_layers M3] routing_direction vertical
Information: The design specific attribute override for layer 'M3' is set in the current block 'pulpissimo_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M3}
icc2_shell> set_attribute [get_layers M4] routing_direction horizontal
Information: The design specific attribute override for layer 'M4' is set in the current block 'pulpissimo_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M4}
icc2_shell> set_attribute [get_layers M5] routing_direction vertical
Information: The design specific attribute override for layer 'M5' is set in the current block 'pulpissimo_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M5}
icc2_shell> set_attribute [get_layers M6] routing_direction horizontal
Information: The design specific attribute override for layer 'M6' is set in the current block 'pulpissimo_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M6}
icc2_shell> set_attribute [get_layers M7] routing_direction vertical
Information: The design specific attribute override for layer 'M7' is set in the current block 'pulpissimo_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M7}
icc2_shell> set_attribute [get_layers M8] routing_direction horizontal
Information: The design specific attribute override for layer 'M8' is set in the current block 'pulpissimo_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M8}
icc2_shell> set_attribute [get_layers M9] routing_direction vertical
Information: The design specific attribute override for layer 'M9' is set in the current block 'pulpissimo_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M9}
icc2_shell> set_attribute [get_layers MRDL] routing_direction horizontal
Information: The design specific attribute override for layer 'MRDL' is set in the current block 'pulpissimo_fp', because the actual library setting may not be overwritten. (ATTR-12)
{MRDL}
icc2_shell> initialize_floorplan -control_type core   -core_utilization 0.6   -flip_first_row true   -core_offset {12.4 12.4 12.4 12.4}
Removing existing floorplan objects
Creating core...
Core utilization ratio = 60.02%
Unplacing all cells...
Creating site array...
Creating routing tracks...
Initializing floorplan completed.
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start MoveTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -abort
icc2_shell> remove_tracks -all
20
icc2_shell> create_track -layer M1 -coord 0.079 -space 0.074
Warning: Direction is not specified. Using the layer preferred direction. (NDMUI-125)
Warning: Count value is not specified. Covering the bounding box of track, depending on its space value. (NDMUI-136)
{TRACK_0}
icc2_shell> create_track -layer M2 -coord 0.04  -space 0.06
Warning: Direction is not specified. Using the layer preferred direction. (NDMUI-125)
Warning: Count value is not specified. Covering the bounding box of track, depending on its space value. (NDMUI-136)
{TRACK_1}
icc2_shell> create_track -layer M3 -space 0.074
Warning: Direction is not specified. Using the layer preferred direction. (NDMUI-125)
Warning: Count value is not specified. Covering the bounding box of track, depending on its space value. (NDMUI-136)
Warning: Coordinate value is not specified. Using coordinate that is half of the space distance inside of the die area. (NDMUI-122)
{TRACK_2}
icc2_shell> create_track -layer M4 -space 0.074
Warning: Direction is not specified. Using the layer preferred direction. (NDMUI-125)
Warning: Count value is not specified. Covering the bounding box of track, depending on its space value. (NDMUI-136)
Warning: Coordinate value is not specified. Using coordinate that is half of the space distance inside of the die area. (NDMUI-122)
{TRACK_3}
icc2_shell> create_track -layer M5 -space 0.12
Warning: Direction is not specified. Using the layer preferred direction. (NDMUI-125)
Warning: Count value is not specified. Covering the bounding box of track, depending on its space value. (NDMUI-136)
Warning: Coordinate value is not specified. Using coordinate that is half of the space distance inside of the die area. (NDMUI-122)
{TRACK_4}
icc2_shell> create_track -layer M6 -space 0.12
Warning: Direction is not specified. Using the layer preferred direction. (NDMUI-125)
Warning: Count value is not specified. Covering the bounding box of track, depending on its space value. (NDMUI-136)
Warning: Coordinate value is not specified. Using coordinate that is half of the space distance inside of the die area. (NDMUI-122)
{TRACK_5}
icc2_shell> create_track -layer M7 -space 0.12
Warning: Direction is not specified. Using the layer preferred direction. (NDMUI-125)
Warning: Count value is not specified. Covering the bounding box of track, depending on its space value. (NDMUI-136)
Warning: Coordinate value is not specified. Using coordinate that is half of the space distance inside of the die area. (NDMUI-122)
{TRACK_6}
icc2_shell> create_track -layer M8 -space 0.12
Warning: Direction is not specified. Using the layer preferred direction. (NDMUI-125)
Warning: Count value is not specified. Covering the bounding box of track, depending on its space value. (NDMUI-136)
Warning: Coordinate value is not specified. Using coordinate that is half of the space distance inside of the die area. (NDMUI-122)
{TRACK_7}
icc2_shell> create_track -layer M9 -space 0.12
Warning: Direction is not specified. Using the layer preferred direction. (NDMUI-125)
Warning: Count value is not specified. Covering the bounding box of track, depending on its space value. (NDMUI-136)
Warning: Coordinate value is not specified. Using coordinate that is half of the space distance inside of the die area. (NDMUI-122)
{TRACK_8}
icc2_shell> create_track -layer MRDL -space 0.6
Warning: Direction is not specified. Using the layer preferred direction. (NDMUI-125)
Warning: Count value is not specified. Covering the bounding box of track, depending on its space value. (NDMUI-136)
Warning: Coordinate value is not specified. Using coordinate that is half of the space distance inside of the die area. (NDMUI-122)
{TRACK_9}
icc2_shell> set_block_pin_constraints -allowed_layers {M3 M4 M5} -pin_spacing 8 -self
Information: Block pin constraints pin_spacing, allowed_layers are set for top block pulpissimo_fp. (DPPA-403)
1
icc2_shell> place_pins -ports [get_ports *] -self

Min routing layer: M1
Max routing layer: MRDL

Non default block pin constraint setting(s) of top block: pulpissimo
pin_spacing:    8
allowed_layers: M3 M4 M5 

Number of block ports: 56
Number of block pin locations assigned from router: 0
Number of PG ports on blocks: 0
Number of pins created: 56
CPU Time for Pin Placement: 00:00:00.05u 00:00:00.00s 00:00:00.05e: 
Total Pin Placement CPU Time: 00:00:01.13u 00:00:03.11s 00:00:04.26e: 
1
icc2_shell> ##
icc2_shell> set MIN_ROUTING_LAYER            "M1"   ;# Min routing layer
M1
icc2_shell> set MAX_ROUTING_LAYER            "M9"   ;# Max routing layer
M9
icc2_shell> set_ignored_layers     -min_routing_layer  $MIN_ROUTING_LAYER     -max_routing_layer  $MAX_ROUTING_LAYER
1
icc2_shell> create_tap_cells -lib_cell saed32rvt_ss0p95vn40c/DCAP_RVT -pattern stagger -distance 15
Warning: Site master "unit" has neither X-Symmetry nor Y-Symmetry.The "legal orientations" for the standard cells will be limited. (LGL-031)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 0 total shapes.
Cached 0 vias out of 0 total vias.
Information: Starting tap cell insertion into pulpissimo_fp using site master "unit". (CHF-200)
        10% complete ...
        20% complete ...
        30% complete ...
        40% complete ...
        50% complete ...
        60% complete ...
        70% complete ...
        80% complete ...
        90% complete ...
        0% complete ...
Information: Total 1029180 tap cells inserted successfully into pulpissimo_fp. (CHF-100)
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
1
icc2_shell> report_ports [all_inputs] > /home/ICer/Desktop/pulp/floor_planning/report/input_port.rpt
icc2_shell> report_ports [all_outputs] > /home/ICer/Desktop/pulp/floor_planning/report/output_port.rpt
icc2_shell> report_cell  > /home/ICer/Desktop/pulp/floor_planning/report/cells.rpt
icc2_shell> report_nets  > /home/ICer/Desktop/pulp/floor_planning/report/nets.rpt
icc2_shell> report_qor   > /home/ICer/Desktop/pulp/floor_planning/report/qor.rpt
icc2_shell> report_utilization > /home/ICer/Desktop/pulp/floor_planning/report/utilization.rpt
icc2_shell> get_placement_blockages > /home/ICer/Desktop/pulp/floor_planning/report/Blockage.rpt
icc2_shell> write_def /home/ICer/Desktop/pulp/floor_planning/output/pulpissimo_top.def
****************************************
Report : Data Mismatches
Version: O-2018.06-SP1
Date   : Thu Sep 11 01:21:21 2025
****************************************
No mismatches exist on the design.
---------------------------------------
Number of Written DEF Constructs
---------------------------------------
VERSION                        : 1
DIVIDERCHAR                    : 1
BUSBITCHARS                    : 1
DESIGN                         : 1
UNITS                          : 1
PROPERTYDEFINITIONS            : 1
DIEAREA                        : 1
ROW                            : 3025
TRACKS                         : 10
COMPONENTS                     : 1282993
PINS                           : 56
PINPROPERTIES                  : 56
NETS                           : 269478
1
icc2_shell> write_verilog -include {all} /home/ICer/Desktop/pulp/floor_planning/output/pulpissimo_top.v
1
icc2_shell> write_sdc -output /home/ICer/Desktop/pulp/floor_planning/output/pulpissimo_top.sdc
1
icc2_shell> save_block
Information: Saving block 'pulpissimo.dlib:pulpissimo_fp.design'
1
icc2_shell> exit
Maximum memory usage for this session: 2195.76 MB
CPU usage for this session:    329 seconds (  0.09 hours)
Elapsed time for this session:   1770 seconds (  0.49 hours)
Thank you for using IC Compiler II.

