#@ # 
#@ # Running icc2_shell Version O-2018.06-SP1 for linux64 -- Jul 17, 2018
#@ # Date:   Thu Sep 11 01:05:55 2025
#@ # Run by: ICer@IC_EDA
#@ 

set design pulpissimo
sh rm /home/ICer/Desktop/pulp/ndm/pulpissimo.dlib/pulpissimo_setup/design.ndm.lock
set design_lib_path /home/ICer/Desktop/pulp/ndm
open_block /home/ICer/Desktop/pulp/ndm/pulpissimo.dlib:pul2pissimo_setup.design
copy_block -from_block pulpissimo.dlib:pul2pissimo_setup.design -to_block ${design}_fp
current_block ${design}_fp.design
start_gui
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
link_block
set_attribute [get_layers M1] routing_direction vertical
set_attribute [get_layers M2] routing_direction horizontal
set_attribute [get_layers M3] routing_direction vertical
set_attribute [get_layers M4] routing_direction horizontal
set_attribute [get_layers M5] routing_direction vertical
set_attribute [get_layers M6] routing_direction horizontal
set_attribute [get_layers M7] routing_direction vertical
set_attribute [get_layers M8] routing_direction horizontal
set_attribute [get_layers M9] routing_direction vertical
set_attribute [get_layers MRDL] routing_direction horizontal
initialize_floorplan -control_type core   -core_utilization 0.6   -flip_first_row true   -core_offset {12.4 12.4 12.4 12.4}
win_set_filter -visible -class cell -filter {hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-82}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region pin_blockage block_shielding topology_node topology_edge core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {cell_array hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-82}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region pin_blockage topology_node topology_edge edit_group shape via placement_blockage }
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start MoveTool
gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -abort
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-696.208 3426.416}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {-696.208 3426.416}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {-696.208 3426.416}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {-696.208 3426.416}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {-696.208 3426.416}
remove_tracks -all
create_track -layer M1 -coord 0.079 -space 0.074
create_track -layer M2 -coord 0.04  -space 0.06
create_track -layer M3 -space 0.074
create_track -layer M4 -space 0.074
create_track -layer M5 -space 0.12
create_track -layer M6 -space 0.12
create_track -layer M7 -space 0.12
create_track -layer M8 -space 0.12
create_track -layer M9 -space 0.12
create_track -layer MRDL -space 0.6
set_block_pin_constraints -allowed_layers {M3 M4 M5} -pin_spacing 8 -self
place_pins -ports [get_ports *] -self
##
set MIN_ROUTING_LAYER            "M1"   ;# Min routing layer
set MAX_ROUTING_LAYER            "M9"   ;# Max routing layer
set_ignored_layers     -min_routing_layer  $MIN_ROUTING_LAYER     -max_routing_layer  $MAX_ROUTING_LAYER
create_tap_cells -lib_cell saed32rvt_ss0p95vn40c/DCAP_RVT -pattern stagger -distance 15
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2751.665 867.159}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2751.665 867.159}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2751.665 867.159}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2751.665 867.159}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2751.665 908.263}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2751.665 908.263}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2756.841 899.794}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2756.841 899.794}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2756.841 899.794}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2756.854 899.791}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2756.860 899.784}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2756.867 899.787}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2756.864 899.784}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2756.862 899.782}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2756.852 899.788}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2756.800 899.781}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2756.841 899.794}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2756.841 899.794}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2756.841 899.794}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2757.312 899.794}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2757.312 898.853}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2759.194 896.971}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2759.194 896.971}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2766.722 896.971}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2781.778 896.971}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {3957.628 49.435}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {3957.628 49.435}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {3957.628 49.435}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {3957.628 49.435}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {3957.628 49.435}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {4006.780 -2.993}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {4008.418 -1.355}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {4008.418 -0.945}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {4006.985 5.813}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4007.007 6.042}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4006.985 6.018}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4007.599 5.608}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4007.599 5.198}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4006.780 5.198}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4006.780 3.560}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4010.057 3.560}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4010.057 -2.993}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4010.057 -2.993}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4010.057 -2.993}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {4010.057 -2.993}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {3852.770 4243.739}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {3852.770 4243.739}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {3852.770 4243.739}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {3852.770 4243.739}
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
win_set_filter -visible -class routing_blockage -layer {4}
win_set_filter -visible -class shape -filter {} -layer {4}
win_set_filter -visible -class via -filter {} -layer {4}
win_set_filter -visible -class terminal -filter {}  -layer {4}
win_set_filter -class routing_blockage -layer {4}
win_set_filter -class shape -filter {} -layer {4}
win_set_filter -class via -filter {} -layer {4}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2332.335 1779.586}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.128 1753.338}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.131 1753.359}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.128 1753.368}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2306.131 1753.365}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.129 1753.364}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.135 1753.367}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.144 1753.370}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.136 1753.385}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.185 1753.420}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2306.121 1753.371}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2332.335 1727.157}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2332.335 1727.157}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2279.906 1727.157}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {2279.906 1727.157}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {2279.906 1727.157}
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
win_set_filter -visible -class routing_blockage -layer {}
win_set_filter -visible -class shape -filter {} -layer {}
win_set_filter -visible -class via -filter {} -layer {}
win_set_filter -visible -class terminal -filter {}  -layer {}
win_set_filter -class routing_blockage -layer {}
win_set_filter -class shape -filter {} -layer {}
win_set_filter -class via -filter {} -layer {}
report_ports [all_inputs] > /home/ICer/Desktop/pulp/floor_planning/report/input_port.rpt
report_ports [all_outputs] > /home/ICer/Desktop/pulp/floor_planning/report/output_port.rpt
report_cell  > /home/ICer/Desktop/pulp/floor_planning/report/cells.rpt
report_nets  > /home/ICer/Desktop/pulp/floor_planning/report/nets.rpt
report_qor   > /home/ICer/Desktop/pulp/floor_planning/report/qor.rpt
report_utilization > /home/ICer/Desktop/pulp/floor_planning/report/utilization.rpt
get_placement_blockages > /home/ICer/Desktop/pulp/floor_planning/report/Blockage.rpt
write_def /home/ICer/Desktop/pulp/floor_planning/output/pulpissimo_top.def
write_verilog -include {all} /home/ICer/Desktop/pulp/floor_planning/output/pulpissimo_top.v
write_sdc -output /home/ICer/Desktop/pulp/floor_planning/output/pulpissimo_top.sdc
save_block
exit
